w6d3/first/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Jess"], ["email", "jess@gmail.com"]]
---
    def create
        user = User.new(user_params)
        if user.save!