w7d3/goal_app/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "session_token", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"